abbreviate:shorten (usually text):verb
accordingly:in a corresponding way; in a related way:adverb
accountable:responsible for actions and decisions;expected to justify decisions:adjective
acquiesce:accept something reluctantly:verb
adequate:satisfactory, acceptable:adjective
advantage
adverse
advocate
alacrity
alleged
amplify
analogy
annotate
anomaly
antecedent
antithesis
articulate
aspect
assert
assume
allude
authentic
autonomy
attribute
bias
brazen
claim
clarify
reinforce
calculate
capitalise
catalyst
cause
characterise
circumspect
clandestine
coerce
coherent
compelling
condone
consensus
constitute
construct
contend
context
contrary
conundrum
converse
convey
correlate
correlation
corroborate
counterargument
credible
critique
cumulative
deduce
demonstrate
denotation
denote
derive: obtain, get something from : verb
deter: discourage someone from doing something : verb
determine
devise
dichotomy : a division between two opposite things : noun
differentiate : tell what makes something different : verb
discredit
distinguish : tell something is different : verb
divisive : causing disagreement between people : adjective
dubious : not trustworthy, to be doubted : adjective
egalitarian : bringing equality to all people : adjective
elucidate : explain clearly : verb
engender : cause, bring about, give rise to : verb
enmity : feeling of opposition, mistrust or hostility: adjective
entrenched : deeply fixed, rooted, ingrained : adjective
enumerate : count out, list : verb
equivalent
erroneous
esoteric
establish
eliminate
entail
emphasise
essentially
exacerbate
exemplar
explicit
expository
extol
evaluate
evidence
evoke
fabricate
facet
factor
figurative
foremost
former
formulate
foster
furthermore
generalisation
hypocrisy
hypothesize
illustrate
impetus
implication
implicit
imply
inadvertent
incisive
incomprehensible
incorporate
indicate
infer
inference
induce
insinuate
instil
insular
integrate
introduce
invariably
invert
inveterate
mantra
maxim
meticulous
modicum
myriad
nominal
notwithstanding
nuance
objective
obtain
obtuse
opportunistic
outline
notice
panacea
paradigm
paraphrase
paramount
persuade
plausible
plethora
portray
power
precedent
precipitate
preclude
presume
prior
proponent
prosperity
provenance
rationale
reactionary
reason
rebut
recapitulate
rectify
refute
reiterate
represent
representative
resurgence
revisionist
salient
scrutinise
significant
signify
speculate
subordinate
subsequent
substantial
substantiate
succinct
suggest
superfluous
support
symbolise
synthesis
synthesize
systematic
terminology
tenuous
thereafter
thesis
tier
trait
transition
ubiquitous
unprecedented
variation
verify
wanton
warrant
watershed
whereas
nevertheless
moreover
whereas
